{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 384,
  "id2label": {
    "0": "CONTINUE",
    "1": "STOP",
    "2": "ASK_USER"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1536,
  "is_decoder": false,
  "label2id": {
    "ASK_USER": 2,
    "CONTINUE": 0,
    "STOP": 1
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.8.1",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 30522
}
